/******************************************************************************
C1) МОДУЛЬ ЧИСЛА
Составить функцию, модуль числа и привести пример ее использования.
Input format: Целое число
Output format: Целое не отрицательное число

*******************************************************************************/
#include <stdio.h>

int modulus(int num) {
   
    if ( num < 0 ) {
        
        return -num;
    }
    
    return num;
    
}

int main()
{   
    int n;
   
    scanf("%d", &n);
 
  
    printf("%d", modulus(n));
  
    return 0;
}
