#include <stdio.h>                  // подключаем заголовочный файл stdio.h
int main(void)                      // определяем функцию main
{                                   // начало функции
    printf("     *\n");             // выводим строку на консоль
    printf("    ***\n");            // выводим строку на консоль
    printf("   *****\n");           // выводим строку на консоль
    printf("  *******\n");          // выводим строку на консоль
    printf("   HHOHH\n");           // выводим строку на консоль
    printf("   ZZZZZ\n");           // выводим строку на консоль

    return 0;                       // выходим из функции
}  
