/******************************************************************************
A4) ПОИСК ПОСЛЕДОВАТЕЛЬНОСТИ БИТ
На вход программе подается беззнаковое 32-битное целое число N и натуральное число K (1 ≤ K ≤ 31). 
Требуется взять K подряд идущих битов числа N так, чтобы полученное число было максимальным. 
Программа должна вывести полученное число.

#Вход: 2 1 
#Выход: 1 
*******************************************************************************/
#include <stdio.h>

int main(void)
{
    unsigned int N, K;
    scanf("%u %u", &N, &K);
    
    if (K == 0) {       //Проверяем корректность К
        printf("0\n");  //Если К = 0, окно нулевое - рез-т тоже 0
        return 0;
    }
    
    if (K > 32) {
        K = 32;         //Если К > 32, то мы максимум можем взять 32 бита
    }
    
    //Маска: 
    //Если К=32, то (1U << K) вызовет неопред. поведение (сдвиг на 32 для 32-битного)
    //Поэтому обрабатываем этот случай отдельно
    unsigned int mask;
    if (K == 32) {
        mask = 0xFFFFFFFF; //все 32 бита - единицы
    } else {
        mask = (1U << K) - 1;
    }
    
     unsigned int max_value = 0;
     
    // Вычисляем максимальное количество итераций
    // Если K=32, то только одно окно (i=0)
    int max_i = (K == 32) ? 0 : (32 - K);
    
    for (int i = 0; i <= max_i; i++) {
        unsigned int shifted = N >> i;
        unsigned int current = shifted & mask;
        
        if (current > max_value) {
            max_value = current;
        }
    }
    
    printf("%u\n", max_value);
    
    return 0;
}
    

