/******************************************************************************
A2) ЦИКЛИЧЕСКИЙ СДВИГ
На вход программе подается беззнаковое 32-битное целое число N и натуральное число K (1 ≤ K ≤ 31). 
Требуется циклически сдвинуть биты числа N вправо на K битов и вывести полученное 
таким образом число.

#Входные данные: 2 1
#Результат работы: 1
*******************************************************************************/
#include <stdio.h>
#include <stdint.h> 

int main()
{
    uint32_t N; 
    unsigned int K; // величина сдвига (только положительное)
    
    scanf("%u %u", &N, &K);
    
    K %= 32;        // на случай, если будет введено число >= 32 (цикл. сдвиг на 32 бита для 32-битного числа вернет то же самое число)

    uint32_t mask = (1U << K) - 1;               //маска для выделения K младших битов
    uint32_t right_bits = N & mask;              //выделяем К младших битов из N
    uint32_t left_part = right_bits << (32 - K); //Сдвигаем выделенные биты в старшие позиции
    uint32_t right_part = N >> K;                //Сдвигаем исходное число N вправо на K битов
    uint32_t result = left_part | right_part;    //Объединяем две части с помощью побитового ИЛИ (оператор |)
     printf("%u\n", result);                     //ВЫводим результат
    
    return 0;
}