/******************************************************************************
A3) ИЗВЛЕЧЕНИЕ БИТ
На вход программе подается беззнаковое 32-битное целое число N и натуральное число K (1 ≤ K ≤ 31). 
Требуется взять K младших битов числа N и вывести полученное таким образом число.

#Входные данные: 2 1
#Результат работы: 0
*******************************************************************************/
#include <stdio.h>

int main(void)
{
    unsigned int N; //исход число
    unsigned int K; //кол-во извлекаемых битов
    
    scanf("%u %u", &N, &K);
    
    K %= 32;        // на случай, если будет введено число >= 32 (цикл. сдвиг на 32 бита для 32-битного числа вернет то же самое число)

    unsigned int mask_base = 1U << K; // число, у которого в K-м бите стоит 1, а остальные 0
    unsigned int mask = mask_base - 1; //маска из K единиц в младших битах
    unsigned int result = N & mask; //Извлекаем K младших битов из числа N
    
     printf("%u\n", result);
    
    return 0;
}