/******************************************************************************
Ввести целое число и определить количество цифр в нём
Ввести целое число и определить сумму цифр в нём
Ввести целое число и определить произведение цифр в
нём
*******************************************************************************/
#include <stdio.h>

int main()
{
    int n;
    
    scanf("%d", &n);
    
    int count = 0;
    int sum = 0;
    int prod = 1;
    
    int n1 = n;
    
    while (n1 != 0) { //считаем количество цифр
        count++;
        n1 /= 10;
    }
    
    int n2 = n;
    
     while (n2 > 0) {  //считаем сумму цифр      
          int digit = n2 % 10;
          sum += digit;
          n2 /= 10;
        }
    
    int n3 = n;
    
    while (n3 > 0) {  //считаем произведение цифр      
          int digit = n3 % 10;
          prod *= digit;
          n3 /= 10;
        }
        
    printf("Количество цифр в числе: %d\n", count);
    printf("Сумма цифр в числе: %d\n", sum);
    printf("Произведение цифр в числе: %d\n", prod);
    
    return 0;
}
