/******************************************************************************
Пример с оператором switch
*******************************************************************************/
#include <stdio.h>

int main()
{
   int expr, a = 2, b = 1;
   scanf("%d", &expr);
   
   switch (expr) {
    case 2 : 
      a *= 2;       // Если expr == 2
      
    case 3 : 
        a += 5;       // Если expr == 3 (или при проваливании из case 2)
        break;        // Выход из switch
        
    case 4 : 
        a -= b;       // Если expr == 4 
        break;
        
    default : 
         break;        // Для всех остальных значений expr
    }
   
    
    printf("%d -> %d", expr, a);
    return 0;
}

