/******************************************************************************
7) На вход подается произвольное трехзначное число, 
напечатать сумму цифр
*******************************************************************************/
#include <stdio.h>

int main()
{
    int a;
    
    scanf("%d", &a);

   if (a < 100 && a > 999) {
       return 1;
   }
   
   int a1 = a;
   int sum = 0;
   
   
   while (a1 > 0) {
       int digit = a1 % 10;
       sum += digit;
       a1 = a1 / 10;
   }
   
   printf("Сумма цифр числа %d: %d", a, sum);
    
    return 0;
}
