/******************************************************************************
5) Ввести три числа и найти их:
- сумму;
- произведение;
- среднее арифметическое;
- разность.
*******************************************************************************/
#include <stdio.h>

int main()
{
     int a, b, c; 
     
    printf("Введите три числа: \n");
    scanf("%d %d %d", &a, &b, &c);

    int sum = a + b + c;
    long prod = a * b * c;
    float mean = ((float)a + (float)b + (float)c) / 3;
    int dif = a - b;

    printf("Сумма чисел: %d\n", sum);
    printf("Произведение чисел: %ld\n", prod);
    printf("Среднее арифметическое чисел: %.3f\n", mean);
    printf("Разность первых двух чисел: %d\n", dif);
    
    return 0;
}
