/******************************************************************************
2) Есть переменная int x. 
Если x=0, вывести “NO". Если х > 0, то вывести “YES”. 
Написать код необходимо с  с помощью if и тернарных операций.
*******************************************************************************/
#include <stdio.h>

int main()
{
    int x;
    scanf("%d", &x);
    
    (x == 0) ? printf("NO\n") :
    (x > 0) ?  printf("YES\n") :
    0;                          //дефолтное ничто для х <0

    return 0;
}
