/******************************************************************************
B21) ЗАГЛАВНЫЕ В СТРОЧНЫЕ
Дан текст состоящий из английских букв и цифр, заканчивается символом «.» 
Перевести все заглавные английские буквы в строчные.
Input format: Текст из маленьких, больших английских букв и пробелов. 
В конце текста символ точка
Output fromat: Текст из маленьких английских букв.
*******************************************************************************/
#include <stdio.h>

int main()
{
   char c;  // Переменная для хранения текущего символа
    
    // Считываем первый символ
    scanf("%c", &c);
    
    // Обрабатываем символы до тех пор, пока не встретим точку
    while (c != '.') {
        // Проверяем, является ли символ заглавной английской буквой (A-Z)
        if (c >= 'A' && c <= 'Z') {
            // Преобразуем заглавную букву в строчную
            c = c + 32;  // В ASCII разница между 'A' и 'a' составляет 32
        }
        
        // Выводим обработанный символ
        printf("%c", c);
        
        // Считываем следующий символ
        scanf("%c", &c);
    }
    
    /* Выводим завершающую точку
    printf(".");*/
    
    return 0;  // Завершаем программу
}